Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.APC9 */
#define IFX_EVADC_ACCPROT0_APC9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.APC9 */
#define IFX_EVADC_ACCPROT0_APC9_OFF (9u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API0 */
#define IFX_EVADC_ACCPROT0_API0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API0 */
#define IFX_EVADC_ACCPROT0_API0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API0 */
#define IFX_EVADC_ACCPROT0_API0_OFF (16u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API10 */
#define IFX_EVADC_ACCPROT0_API10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API10 */
#define IFX_EVADC_ACCPROT0_API10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API10 */
#define IFX_EVADC_ACCPROT0_API10_OFF (26u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API11 */
#define IFX_EVADC_ACCPROT0_API11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API11 */
#define IFX_EVADC_ACCPROT0_API11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API11 */
#define IFX_EVADC_ACCPROT0_API11_OFF (27u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API1 */
#define IFX_EVADC_ACCPROT0_API1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API1 */
#define IFX_EVADC_ACCPROT0_API1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API1 */
#define IFX_EVADC_ACCPROT0_API1_OFF (17u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API2 */
#define IFX_EVADC_ACCPROT0_API2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API2 */
#define IFX_EVADC_ACCPROT0_API2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API2 */
#define IFX_EVADC_ACCPROT0_API2_OFF (18u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API3 */
#define IFX_EVADC_ACCPROT0_API3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API3 */
#define IFX_EVADC_ACCPROT0_API3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API3 */
#define IFX_EVADC_ACCPROT0_API3_OFF (19u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API4 */
#define IFX_EVADC_ACCPROT0_API4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API4 */
#define IFX_EVADC_ACCPROT0_API4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API4 */
#define IFX_EVADC_ACCPROT0_API4_OFF (20u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API5 */
#define IFX_EVADC_ACCPROT0_API5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API5 */
#define IFX_EVADC_ACCPROT0_API5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API5 */
#define IFX_EVADC_ACCPROT0_API5_OFF (21u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API6 */
#define IFX_EVADC_ACCPROT0_API6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API6 */
#define IFX_EVADC_ACCPROT0_API6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API6 */
#define IFX_EVADC_ACCPROT0_API6_OFF (22u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API7 */
#define IFX_EVADC_ACCPROT0_API7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API7 */
#define IFX_EVADC_ACCPROT0_API7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API7 */
#define IFX_EVADC_ACCPROT0_API7_OFF (23u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API8 */
#define IFX_EVADC_ACCPROT0_API8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API8 */
#define IFX_EVADC_ACCPROT0_API8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API8 */
#define IFX_EVADC_ACCPROT0_API8_OFF (24u)

/** \brief  Length for Ifx_EVADC_ACCPROT0_Bits.API9 */
#define IFX_EVADC_ACCPROT0_API9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT0_Bits.API9 */
#define IFX_EVADC_ACCPROT0_API9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT0_Bits.API9 */
#define IFX_EVADC_ACCPROT0_API9_OFF (25u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR0 */
#define IFX_EVADC_ACCPROT1_APR0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR0 */
#define IFX_EVADC_ACCPROT1_APR0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR0 */
#define IFX_EVADC_ACCPROT1_APR0_OFF (16u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR10 */
#define IFX_EVADC_ACCPROT1_APR10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR10 */
#define IFX_EVADC_ACCPROT1_APR10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR10 */
#define IFX_EVADC_ACCPROT1_APR10_OFF (26u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR11 */
#define IFX_EVADC_ACCPROT1_APR11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR11 */
#define IFX_EVADC_ACCPROT1_APR11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR11 */
#define IFX_EVADC_ACCPROT1_APR11_OFF (27u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR1 */
#define IFX_EVADC_ACCPROT1_APR1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR1 */
#define IFX_EVADC_ACCPROT1_APR1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR1 */
#define IFX_EVADC_ACCPROT1_APR1_OFF (17u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR2 */
#define IFX_EVADC_ACCPROT1_APR2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR2 */
#define IFX_EVADC_ACCPROT1_APR2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR2 */
#define IFX_EVADC_ACCPROT1_APR2_OFF (18u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR3 */
#define IFX_EVADC_ACCPROT1_APR3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR3 */
#define IFX_EVADC_ACCPROT1_APR3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR3 */
#define IFX_EVADC_ACCPROT1_APR3_OFF (19u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR4 */
#define IFX_EVADC_ACCPROT1_APR4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR4 */
#define IFX_EVADC_ACCPROT1_APR4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR4 */
#define IFX_EVADC_ACCPROT1_APR4_OFF (20u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR5 */
#define IFX_EVADC_ACCPROT1_APR5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR5 */
#define IFX_EVADC_ACCPROT1_APR5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR5 */
#define IFX_EVADC_ACCPROT1_APR5_OFF (21u)

