Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR6 */
#define IFX_EVADC_ACCPROT1_APR6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR6 */
#define IFX_EVADC_ACCPROT1_APR6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR6 */
#define IFX_EVADC_ACCPROT1_APR6_OFF (22u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR7 */
#define IFX_EVADC_ACCPROT1_APR7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR7 */
#define IFX_EVADC_ACCPROT1_APR7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR7 */
#define IFX_EVADC_ACCPROT1_APR7_OFF (23u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR8 */
#define IFX_EVADC_ACCPROT1_APR8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR8 */
#define IFX_EVADC_ACCPROT1_APR8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR8 */
#define IFX_EVADC_ACCPROT1_APR8_OFF (24u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APR9 */
#define IFX_EVADC_ACCPROT1_APR9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APR9 */
#define IFX_EVADC_ACCPROT1_APR9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APR9 */
#define IFX_EVADC_ACCPROT1_APR9_OFF (25u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS0 */
#define IFX_EVADC_ACCPROT1_APS0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS0 */
#define IFX_EVADC_ACCPROT1_APS0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS0 */
#define IFX_EVADC_ACCPROT1_APS0_OFF (0u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS10 */
#define IFX_EVADC_ACCPROT1_APS10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS10 */
#define IFX_EVADC_ACCPROT1_APS10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS10 */
#define IFX_EVADC_ACCPROT1_APS10_OFF (10u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS11 */
#define IFX_EVADC_ACCPROT1_APS11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS11 */
#define IFX_EVADC_ACCPROT1_APS11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS11 */
#define IFX_EVADC_ACCPROT1_APS11_OFF (11u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS1 */
#define IFX_EVADC_ACCPROT1_APS1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS1 */
#define IFX_EVADC_ACCPROT1_APS1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS1 */
#define IFX_EVADC_ACCPROT1_APS1_OFF (1u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS2 */
#define IFX_EVADC_ACCPROT1_APS2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS2 */
#define IFX_EVADC_ACCPROT1_APS2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS2 */
#define IFX_EVADC_ACCPROT1_APS2_OFF (2u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS3 */
#define IFX_EVADC_ACCPROT1_APS3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS3 */
#define IFX_EVADC_ACCPROT1_APS3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS3 */
#define IFX_EVADC_ACCPROT1_APS3_OFF (3u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS4 */
#define IFX_EVADC_ACCPROT1_APS4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS4 */
#define IFX_EVADC_ACCPROT1_APS4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS4 */
#define IFX_EVADC_ACCPROT1_APS4_OFF (4u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS5 */
#define IFX_EVADC_ACCPROT1_APS5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS5 */
#define IFX_EVADC_ACCPROT1_APS5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS5 */
#define IFX_EVADC_ACCPROT1_APS5_OFF (5u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS6 */
#define IFX_EVADC_ACCPROT1_APS6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS6 */
#define IFX_EVADC_ACCPROT1_APS6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS6 */
#define IFX_EVADC_ACCPROT1_APS6_OFF (6u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS7 */
#define IFX_EVADC_ACCPROT1_APS7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS7 */
#define IFX_EVADC_ACCPROT1_APS7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS7 */
#define IFX_EVADC_ACCPROT1_APS7_OFF (7u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS8 */
#define IFX_EVADC_ACCPROT1_APS8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS8 */
#define IFX_EVADC_ACCPROT1_APS8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS8 */
#define IFX_EVADC_ACCPROT1_APS8_OFF (8u)

/** \brief  Length for Ifx_EVADC_ACCPROT1_Bits.APS9 */
#define IFX_EVADC_ACCPROT1_APS9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT1_Bits.APS9 */
#define IFX_EVADC_ACCPROT1_APS9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT1_Bits.APS9 */
#define IFX_EVADC_ACCPROT1_APS9_OFF (9u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_OFF (17u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF12 */
#define IFX_EVADC_ACCPROT2_APF12_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF12 */
#define IFX_EVADC_ACCPROT2_APF12_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF12 */
#define IFX_EVADC_ACCPROT2_APF12_OFF (0u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF13 */
#define IFX_EVADC_ACCPROT2_APF13_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF13 */
#define IFX_EVADC_ACCPROT2_APF13_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF13 */
#define IFX_EVADC_ACCPROT2_APF13_OFF (1u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF14 */
#define IFX_EVADC_ACCPROT2_APF14_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF14 */
#define IFX_EVADC_ACCPROT2_APF14_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF14 */
#define IFX_EVADC_ACCPROT2_APF14_OFF (2u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF15 */
#define IFX_EVADC_ACCPROT2_APF15_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF15 */
#define IFX_EVADC_ACCPROT2_APF15_MSK (0x1u)

