Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF15 */
#define IFX_EVADC_ACCPROT2_APF15_OFF (3u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF16 */
#define IFX_EVADC_ACCPROT2_APF16_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF16 */
#define IFX_EVADC_ACCPROT2_APF16_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF16 */
#define IFX_EVADC_ACCPROT2_APF16_OFF (4u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF17 */
#define IFX_EVADC_ACCPROT2_APF17_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF17 */
#define IFX_EVADC_ACCPROT2_APF17_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF17 */
#define IFX_EVADC_ACCPROT2_APF17_OFF (5u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF18 */
#define IFX_EVADC_ACCPROT2_APF18_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF18 */
#define IFX_EVADC_ACCPROT2_APF18_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF18 */
#define IFX_EVADC_ACCPROT2_APF18_OFF (6u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APF19 */
#define IFX_EVADC_ACCPROT2_APF19_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APF19 */
#define IFX_EVADC_ACCPROT2_APF19_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APF19 */
#define IFX_EVADC_ACCPROT2_APF19_OFF (7u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_OFF (16u)

/** \brief  Length for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_OFF (18u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_CHCTR_BNDSELL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_CHCTR_BNDSELL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.BNDSELL */
#define IFX_EVADC_CHCTR_BNDSELL_OFF (4u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_CHCTR_BNDSELU_LEN (2u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_CHCTR_BNDSELU_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.BNDSELU */
#define IFX_EVADC_CHCTR_BNDSELU_OFF (6u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_CHCTR_BNDSELX_LEN (4u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_CHCTR_BNDSELX_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.BNDSELX */
#define IFX_EVADC_CHCTR_BNDSELX_OFF (12u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.BWDCH */
#define IFX_EVADC_CHCTR_BWDCH_LEN (2u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.BWDCH */
#define IFX_EVADC_CHCTR_BWDCH_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.BWDCH */
#define IFX_EVADC_CHCTR_BWDCH_OFF (28u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.BWDEN */
#define IFX_EVADC_CHCTR_BWDEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.BWDEN */
#define IFX_EVADC_CHCTR_BWDEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.BWDEN */
#define IFX_EVADC_CHCTR_BWDEN_OFF (30u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_CHCTR_CHEVMODE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_CHCTR_CHEVMODE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.CHEVMODE */
#define IFX_EVADC_CHCTR_CHEVMODE_OFF (8u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_CHCTR_ICLSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_CHCTR_ICLSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.ICLSEL */
#define IFX_EVADC_CHCTR_ICLSEL_OFF (0u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.REFSEL */
#define IFX_EVADC_CHCTR_REFSEL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.REFSEL */
#define IFX_EVADC_CHCTR_REFSEL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.REFSEL */
#define IFX_EVADC_CHCTR_REFSEL_OFF (11u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.RESPOS */
#define IFX_EVADC_CHCTR_RESPOS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.RESPOS */
#define IFX_EVADC_CHCTR_RESPOS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.RESPOS */
#define IFX_EVADC_CHCTR_RESPOS_OFF (21u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.RESREG */
#define IFX_EVADC_CHCTR_RESREG_LEN (4u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.RESREG */
#define IFX_EVADC_CHCTR_RESREG_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.RESREG */
#define IFX_EVADC_CHCTR_RESREG_OFF (16u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.RESTGT */
#define IFX_EVADC_CHCTR_RESTGT_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.RESTGT */
#define IFX_EVADC_CHCTR_RESTGT_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.RESTGT */
#define IFX_EVADC_CHCTR_RESTGT_OFF (20u)

/** \brief  Length for Ifx_EVADC_CHCTR_Bits.SYNC */
#define IFX_EVADC_CHCTR_SYNC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CHCTR_Bits.SYNC */
#define IFX_EVADC_CHCTR_SYNC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CHCTR_Bits.SYNC */
#define IFX_EVADC_CHCTR_SYNC_OFF (10u)

/** \brief  Length for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CLC_Bits.DISR */
#define IFX_EVADC_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_CLC_Bits.DISS */
#define IFX_EVADC_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_MSK (0x1u)

