Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_CLC_Bits.EDIS */
#define IFX_EVADC_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_LEN (4u)

/** \brief  Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_OFF (0u)

/** \brief  Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_LEN (4u)

/** \brief  Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_OFF (4u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFA */
#define IFX_EVADC_FCG_FCBFL_BFA_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFA */
#define IFX_EVADC_FCG_FCBFL_BFA_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFA */
#define IFX_EVADC_FCG_FCBFL_BFA_OFF (4u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFI */
#define IFX_EVADC_FCG_FCBFL_BFI_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFI */
#define IFX_EVADC_FCG_FCBFL_BFI_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFI */
#define IFX_EVADC_FCG_FCBFL_BFI_OFF (8u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFL */
#define IFX_EVADC_FCG_FCBFL_BFL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFL */
#define IFX_EVADC_FCG_FCBFL_BFL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFL */
#define IFX_EVADC_FCG_FCBFL_BFL_OFF (0u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FCG_FCBFL_BFLNP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FCG_FCBFL_BFLNP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FCG_FCBFL_BFLNP_OFF (24u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFM */
#define IFX_EVADC_FCG_FCBFL_BFM_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFM */
#define IFX_EVADC_FCG_FCBFL_BFM_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFM */
#define IFX_EVADC_FCG_FCBFL_BFM_OFF (16u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFS */
#define IFX_EVADC_FCG_FCBFL_BFS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFS */
#define IFX_EVADC_FCG_FCBFL_BFS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFS */
#define IFX_EVADC_FCG_FCBFL_BFS_OFF (12u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.BFV */
#define IFX_EVADC_FCG_FCBFL_BFV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.BFV */
#define IFX_EVADC_FCG_FCBFL_BFV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.BFV */
#define IFX_EVADC_FCG_FCBFL_BFV_OFF (17u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.FCR */
#define IFX_EVADC_FCG_FCBFL_FCR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.FCR */
#define IFX_EVADC_FCG_FCBFL_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.FCR */
#define IFX_EVADC_FCG_FCBFL_FCR_OFF (28u)

/** \brief  Length for Ifx_EVADC_FCG_FCBFL_Bits.VF */
#define IFX_EVADC_FCG_FCBFL_VF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCBFL_Bits.VF */
#define IFX_EVADC_FCG_FCBFL_VF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCBFL_Bits.VF */
#define IFX_EVADC_FCG_FCBFL_VF_OFF (31u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FCG_FCCTRL_AIPF_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FCG_FCCTRL_AIPF_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.AIPF */
#define IFX_EVADC_FCG_FCCTRL_AIPF_OFF (6u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FCG_FCCTRL_CHEVMODE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FCG_FCCTRL_CHEVMODE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.CHEVMODE */
#define IFX_EVADC_FCG_FCCTRL_CHEVMODE_OFF (8u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FCG_FCCTRL_CPWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FCG_FCCTRL_CPWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.CPWC */
#define IFX_EVADC_FCG_FCCTRL_CPWC_OFF (15u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FCG_FCCTRL_DIVA_LEN (5u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FCG_FCCTRL_DIVA_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.DIVA */
#define IFX_EVADC_FCG_FCCTRL_DIVA_OFF (10u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FCG_FCCTRL_FCCHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FCG_FCCTRL_FCCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.FCCHNR */
#define IFX_EVADC_FCG_FCCTRL_FCCHNR_OFF (26u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FCG_FCCTRL_GTMODE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FCG_FCCTRL_GTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.GTMODE */
#define IFX_EVADC_FCG_FCCTRL_GTMODE_OFF (24u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.STCF */
#define IFX_EVADC_FCG_FCCTRL_STCF_LEN (5u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.STCF */
#define IFX_EVADC_FCG_FCCTRL_STCF_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.STCF */
#define IFX_EVADC_FCG_FCCTRL_STCF_OFF (0u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FCG_FCCTRL_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FCG_FCCTRL_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.XTLVL */
#define IFX_EVADC_FCG_FCCTRL_XTLVL_OFF (20u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FCG_FCCTRL_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FCG_FCCTRL_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.XTMODE */
#define IFX_EVADC_FCG_FCCTRL_XTMODE_OFF (21u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FCG_FCCTRL_XTPOL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FCG_FCCTRL_XTPOL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.XTPOL */
#define IFX_EVADC_FCG_FCCTRL_XTPOL_OFF (23u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FCG_FCCTRL_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FCG_FCCTRL_XTSEL_MSK (0xfu)

