Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.XTSEL */
#define IFX_EVADC_FCG_FCCTRL_XTSEL_OFF (16u)

/** \brief  Length for Ifx_EVADC_FCG_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FCG_FCCTRL_XTWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FCG_FCCTRL_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCCTRL_Bits.XTWC */
#define IFX_EVADC_FCG_FCCTRL_XTWC_OFF (31u)

/** \brief  Length for Ifx_EVADC_FCG_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FCG_FCHYST_DELTAMINUS_LEN (10u)

/** \brief  Mask for Ifx_EVADC_FCG_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FCG_FCHYST_DELTAMINUS_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FCG_FCHYST_DELTAMINUS_OFF (2u)

/** \brief  Length for Ifx_EVADC_FCG_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FCG_FCHYST_DELTAPLUS_LEN (10u)

/** \brief  Mask for Ifx_EVADC_FCG_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FCG_FCHYST_DELTAPLUS_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FCG_FCHYST_DELTAPLUS_OFF (18u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.ANON */
#define IFX_EVADC_FCG_FCM_ANON_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.ANON */
#define IFX_EVADC_FCG_FCM_ANON_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.ANON */
#define IFX_EVADC_FCG_FCM_ANON_OFF (5u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.AUE */
#define IFX_EVADC_FCG_FCM_AUE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.AUE */
#define IFX_EVADC_FCG_FCM_AUE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.AUE */
#define IFX_EVADC_FCG_FCM_AUE_OFF (18u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.FCMWC */
#define IFX_EVADC_FCG_FCM_FCMWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.FCMWC */
#define IFX_EVADC_FCG_FCM_FCMWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.FCMWC */
#define IFX_EVADC_FCG_FCM_FCMWC_OFF (21u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.FCRDIR */
#define IFX_EVADC_FCG_FCM_FCRDIR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.FCRDIR */
#define IFX_EVADC_FCG_FCM_FCRDIR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.FCRDIR */
#define IFX_EVADC_FCG_FCM_FCRDIR_OFF (4u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.FCREF */
#define IFX_EVADC_FCG_FCM_FCREF_LEN (10u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.FCREF */
#define IFX_EVADC_FCG_FCM_FCREF_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.FCREF */
#define IFX_EVADC_FCG_FCM_FCREF_OFF (22u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.FCTRIV */
#define IFX_EVADC_FCG_FCM_FCTRIV_LEN (8u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.FCTRIV */
#define IFX_EVADC_FCG_FCM_FCTRIV_MSK (0xffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.FCTRIV */
#define IFX_EVADC_FCG_FCM_FCTRIV_OFF (8u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FCG_FCM_RUNCOMP_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FCG_FCM_RUNCOMP_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.RUNCOMP */
#define IFX_EVADC_FCG_FCM_RUNCOMP_OFF (0u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FCG_FCM_RUNRAMP_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FCG_FCM_RUNRAMP_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.RUNRAMP */
#define IFX_EVADC_FCG_FCM_RUNRAMP_OFF (2u)

/** \brief  Length for Ifx_EVADC_FCG_FCM_Bits.SRG */
#define IFX_EVADC_FCG_FCM_SRG_LEN (2u)

/** \brief  Mask for Ifx_EVADC_FCG_FCM_Bits.SRG */
#define IFX_EVADC_FCG_FCM_SRG_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_FCG_FCM_Bits.SRG */
#define IFX_EVADC_FCG_FCM_SRG_OFF (16u)

/** \brief  Length for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FCG_FCRAMP0_FCRCOMPA_LEN (10u)

/** \brief  Mask for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FCG_FCRAMP0_FCRCOMPA_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRCOMPA */
#define IFX_EVADC_FCG_FCRAMP0_FCRCOMPA_OFF (0u)

/** \brief  Length for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FCG_FCRAMP0_FCRSTEP_LEN (8u)

/** \brief  Mask for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FCG_FCRAMP0_FCRSTEP_MSK (0xffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCRAMP0_Bits.FCRSTEP */
#define IFX_EVADC_FCG_FCRAMP0_FCRSTEP_OFF (16u)

/** \brief  Length for Ifx_EVADC_FCG_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FCG_FCRAMP0_FSWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_FCG_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FCG_FCRAMP0_FSWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_FCG_FCRAMP0_Bits.FSWC */
#define IFX_EVADC_FCG_FCRAMP0_FSWC_OFF (31u)

/** \brief  Length for Ifx_EVADC_FCG_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FCG_FCRAMP1_FCRCOMPB_LEN (10u)

/** \brief  Mask for Ifx_EVADC_FCG_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FCG_FCRAMP1_FCRCOMPB_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_FCG_FCRAMP1_Bits.FCRCOMPB */
#define IFX_EVADC_FCG_FCRAMP1_FCRCOMPB_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_LEN (3u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_OFF (25u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_MSK (0x1u)

