Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_OFF (19u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.ARBM */
#define IFX_EVADC_G_ARBCFG_ARBM_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.ARBM */
#define IFX_EVADC_G_ARBCFG_ARBM_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.ARBM */
#define IFX_EVADC_G_ARBCFG_ARBM_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.ARBRND */
#define IFX_EVADC_G_ARBCFG_ARBRND_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.ARBRND */
#define IFX_EVADC_G_ARBCFG_ARBRND_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.ARBRND */
#define IFX_EVADC_G_ARBCFG_ARBRND_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_OFF (30u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_OFF (18u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_OFF (31u)

/** \brief  Length for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_OFF (25u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_OFF (25u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_OFF (26u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_LEN (12u)

/** \brief  Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief  Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_LEN (12u)

/** \brief  Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief  Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_CEFCLR_Bits.CEV0 */
#define IFX_EVADC_G_CEFCLR_CEV0_LEN (1u)

