Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV3 */
#define IFX_EVADC_G_CEFLAG_CEV3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV3 */
#define IFX_EVADC_G_CEFLAG_CEV3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV3 */
#define IFX_EVADC_G_CEFLAG_CEV3_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV4 */
#define IFX_EVADC_G_CEFLAG_CEV4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV4 */
#define IFX_EVADC_G_CEFLAG_CEV4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV4 */
#define IFX_EVADC_G_CEFLAG_CEV4_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV5 */
#define IFX_EVADC_G_CEFLAG_CEV5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV5 */
#define IFX_EVADC_G_CEFLAG_CEV5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV5 */
#define IFX_EVADC_G_CEFLAG_CEV5_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV6 */
#define IFX_EVADC_G_CEFLAG_CEV6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV6 */
#define IFX_EVADC_G_CEFLAG_CEV6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV6 */
#define IFX_EVADC_G_CEFLAG_CEV6_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV7 */
#define IFX_EVADC_G_CEFLAG_CEV7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV7 */
#define IFX_EVADC_G_CEFLAG_CEV7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV7 */
#define IFX_EVADC_G_CEFLAG_CEV7_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV8 */
#define IFX_EVADC_G_CEFLAG_CEV8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV8 */
#define IFX_EVADC_G_CEFLAG_CEV8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV8 */
#define IFX_EVADC_G_CEFLAG_CEV8_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_CEFLAG_Bits.CEV9 */
#define IFX_EVADC_G_CEFLAG_CEV9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV9 */
#define IFX_EVADC_G_CEFLAG_CEV9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV9 */
#define IFX_EVADC_G_CEFLAG_CEV9_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_LEN (16u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_G_EMUXCS_Bits.EMUXCH */
#define IFX_EVADC_G_EMUXCS_EMUXCH_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_LEN (3u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_EVADC_G_EMUXCTR_EMUXACT_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXCCB */
#define IFX_EVADC_G_EMUXCTR_EMUXCCB_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_LEN (3u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_MSK (0x7u)

