Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_EVADC_G_EMUXCTR_EMUXMODE_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_LEN (3u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_EVADC_G_EMUXCTR_EMUXSET_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_EVADC_G_EMUXCTR_EMXCOD_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_EVADC_G_EMUXCTR_EMXCSS_OFF (14u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXST */
#define IFX_EVADC_G_EMUXCTR_EMXST_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_EVADC_G_EMUXCTR_EMXWC_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_OFF (22u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_OFF (26u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_OFF (14u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_OFF (2u)

