Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV0 */
#define IFX_EVADC_G_REFLAG_REV0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV0 */
#define IFX_EVADC_G_REFLAG_REV0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV0 */
#define IFX_EVADC_G_REFLAG_REV0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV10 */
#define IFX_EVADC_G_REFLAG_REV10_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV11 */
#define IFX_EVADC_G_REFLAG_REV11_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV12 */
#define IFX_EVADC_G_REFLAG_REV12_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV13 */
#define IFX_EVADC_G_REFLAG_REV13_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV14 */
#define IFX_EVADC_G_REFLAG_REV14_OFF (14u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV15 */
#define IFX_EVADC_G_REFLAG_REV15_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV1 */
#define IFX_EVADC_G_REFLAG_REV1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV1 */
#define IFX_EVADC_G_REFLAG_REV1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV1 */
#define IFX_EVADC_G_REFLAG_REV1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV2 */
#define IFX_EVADC_G_REFLAG_REV2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV2 */
#define IFX_EVADC_G_REFLAG_REV2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV2 */
#define IFX_EVADC_G_REFLAG_REV2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV3 */
#define IFX_EVADC_G_REFLAG_REV3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV3 */
#define IFX_EVADC_G_REFLAG_REV3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV3 */
#define IFX_EVADC_G_REFLAG_REV3_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV4 */
#define IFX_EVADC_G_REFLAG_REV4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV4 */
#define IFX_EVADC_G_REFLAG_REV4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV4 */
#define IFX_EVADC_G_REFLAG_REV4_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV5 */
#define IFX_EVADC_G_REFLAG_REV5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV5 */
#define IFX_EVADC_G_REFLAG_REV5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV5 */
#define IFX_EVADC_G_REFLAG_REV5_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV6 */
#define IFX_EVADC_G_REFLAG_REV6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV6 */
#define IFX_EVADC_G_REFLAG_REV6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV6 */
#define IFX_EVADC_G_REFLAG_REV6_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV7 */
#define IFX_EVADC_G_REFLAG_REV7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV7 */
#define IFX_EVADC_G_REFLAG_REV7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV7 */
#define IFX_EVADC_G_REFLAG_REV7_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV8 */
#define IFX_EVADC_G_REFLAG_REV8_LEN (1u)

