Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV8 */
#define IFX_EVADC_G_REFLAG_REV8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV8 */
#define IFX_EVADC_G_REFLAG_REV8_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_REFLAG_Bits.REV9 */
#define IFX_EVADC_G_REFLAG_REV9_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV3NP */
#define IFX_EVADC_G_REVNP0_REV3NP_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV4NP */
#define IFX_EVADC_G_REVNP0_REV4NP_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV5NP */
#define IFX_EVADC_G_REVNP0_REV5NP_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV6NP */
#define IFX_EVADC_G_REVNP0_REV6NP_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP0_Bits.REV7NP */
#define IFX_EVADC_G_REVNP0_REV7NP_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV10NP */
#define IFX_EVADC_G_REVNP1_REV10NP_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV11NP */
#define IFX_EVADC_G_REVNP1_REV11NP_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV12NP */
#define IFX_EVADC_G_REVNP1_REV12NP_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV13NP */
#define IFX_EVADC_G_REVNP1_REV13NP_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV14NP */
#define IFX_EVADC_G_REVNP1_REV14NP_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV15NP */
#define IFX_EVADC_G_REVNP1_REV15NP_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV8NP */
#define IFX_EVADC_G_REVNP1_REV8NP_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_REVNP1_Bits.REV9NP */
#define IFX_EVADC_G_REVNP1_REV9NP_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV0 */
#define IFX_EVADC_G_SEFLAG_SEV0_OFF (0u)

