Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Length for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV1 */
#define IFX_EVADC_G_SEFLAG_SEV1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SEFLAG_Bits.SEV2 */
#define IFX_EVADC_G_SEFLAG_SEV2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_SEVNP_Bits.SEV0NP */
#define IFX_EVADC_G_SEVNP_SEV0NP_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_SEVNP_Bits.SEV1NP */
#define IFX_EVADC_G_SEVNP_SEV1NP_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_SEVNP_Bits.SEV2NP */
#define IFX_EVADC_G_SEVNP_SEV2NP_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.AGSR0 */
#define IFX_EVADC_G_SRACT_AGSR0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.AGSR1 */
#define IFX_EVADC_G_SRACT_AGSR1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.AGSR2 */
#define IFX_EVADC_G_SRACT_AGSR2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.AGSR3 */
#define IFX_EVADC_G_SRACT_AGSR3_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.ASSR0 */
#define IFX_EVADC_G_SRACT_ASSR0_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.ASSR1 */
#define IFX_EVADC_G_SRACT_ASSR1_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.ASSR2 */
#define IFX_EVADC_G_SRACT_ASSR2_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SRACT_Bits.ASSR3 */
#define IFX_EVADC_G_SRACT_ASSR3_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF0 */
#define IFX_EVADC_G_VFR_VF0_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF10 */
#define IFX_EVADC_G_VFR_VF10_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF11 */
#define IFX_EVADC_G_VFR_VF11_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_MSK (0x1u)

