Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF12 */
#define IFX_EVADC_G_VFR_VF12_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF13 */
#define IFX_EVADC_G_VFR_VF13_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF14 */
#define IFX_EVADC_G_VFR_VF14_OFF (14u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF15 */
#define IFX_EVADC_G_VFR_VF15_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF1 */
#define IFX_EVADC_G_VFR_VF1_OFF (1u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF2 */
#define IFX_EVADC_G_VFR_VF2_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF3 */
#define IFX_EVADC_G_VFR_VF3_OFF (3u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF4 */
#define IFX_EVADC_G_VFR_VF4_OFF (4u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF5 */
#define IFX_EVADC_G_VFR_VF5_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF6 */
#define IFX_EVADC_G_VFR_VF6_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF7 */
#define IFX_EVADC_G_VFR_VF7_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF8 */
#define IFX_EVADC_G_VFR_VF8_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_VFR_Bits.VF9 */
#define IFX_EVADC_G_VFR_VF9_OFF (9u)

/** \brief  Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_LEN (12u)

/** \brief  Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief  Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_OFF (0u)

/** \brief  Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_LEN (12u)

/** \brief  Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief  Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_OFF (8u)

/** \brief  Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_OFF (24u)

/** \brief  Length for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_OFF (31u)

/** \brief  Length for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_OFF (24u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_OFF (20u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_LEN (2u)

