Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_OFF (28u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_LEN (3u)

/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_OFF (25u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_LEN (16u)

/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_OFF (0u)

/** \brief  Length for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_OFF (31u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_OFF (20u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_OFF (28u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_LEN (3u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_OFF (25u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_LEN (16u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_OFF (0u)

/** \brief  Length for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_OFF (31u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG0 */
#define IFX_EVADC_GLOB_TE_TFEG0_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG0 */
#define IFX_EVADC_GLOB_TE_TFEG0_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG0 */
#define IFX_EVADC_GLOB_TE_TFEG0_OFF (0u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG10 */
#define IFX_EVADC_GLOB_TE_TFEG10_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG10 */
#define IFX_EVADC_GLOB_TE_TFEG10_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG10 */
#define IFX_EVADC_GLOB_TE_TFEG10_OFF (10u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG11 */
#define IFX_EVADC_GLOB_TE_TFEG11_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG11 */
#define IFX_EVADC_GLOB_TE_TFEG11_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG11 */
#define IFX_EVADC_GLOB_TE_TFEG11_OFF (11u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG1 */
#define IFX_EVADC_GLOB_TE_TFEG1_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG1 */
#define IFX_EVADC_GLOB_TE_TFEG1_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG1 */
#define IFX_EVADC_GLOB_TE_TFEG1_OFF (1u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG2 */
#define IFX_EVADC_GLOB_TE_TFEG2_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG2 */
#define IFX_EVADC_GLOB_TE_TFEG2_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG2 */
#define IFX_EVADC_GLOB_TE_TFEG2_OFF (2u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG3 */
#define IFX_EVADC_GLOB_TE_TFEG3_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG3 */
#define IFX_EVADC_GLOB_TE_TFEG3_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG3 */
#define IFX_EVADC_GLOB_TE_TFEG3_OFF (3u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG4 */
#define IFX_EVADC_GLOB_TE_TFEG4_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG4 */
#define IFX_EVADC_GLOB_TE_TFEG4_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG4 */
#define IFX_EVADC_GLOB_TE_TFEG4_OFF (4u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG5 */
#define IFX_EVADC_GLOB_TE_TFEG5_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG5 */
#define IFX_EVADC_GLOB_TE_TFEG5_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG5 */
#define IFX_EVADC_GLOB_TE_TFEG5_OFF (5u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG6 */
#define IFX_EVADC_GLOB_TE_TFEG6_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG6 */
#define IFX_EVADC_GLOB_TE_TFEG6_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG6 */
#define IFX_EVADC_GLOB_TE_TFEG6_OFF (6u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG7 */
#define IFX_EVADC_GLOB_TE_TFEG7_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG7 */
#define IFX_EVADC_GLOB_TE_TFEG7_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG7 */
#define IFX_EVADC_GLOB_TE_TFEG7_OFF (7u)

/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG8 */
#define IFX_EVADC_GLOB_TE_TFEG8_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG8 */
#define IFX_EVADC_GLOB_TE_TFEG8_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG8 */
#define IFX_EVADC_GLOB_TE_TFEG8_OFF (8u)

