Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Length for Ifx_EVADC_GLOB_TE_Bits.TFEG9 */
#define IFX_EVADC_GLOB_TE_TFEG9_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TE_Bits.TFEG9 */
#define IFX_EVADC_GLOB_TE_TFEG9_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TE_Bits.TFEG9 */
#define IFX_EVADC_GLOB_TE_TFEG9_OFF (9u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_OFF (0u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_OFF (8u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_LEN (4u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_OFF (4u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_OFF (9u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_OFF (15u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_OFF (17u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_OFF (18u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_OFF (23u)

/** \brief  Length for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOBCFG_Bits.CPWC */
#define IFX_EVADC_GLOBCFG_CPWC_OFF (15u)

/** \brief  Length for Ifx_EVADC_GLOBCFG_Bits.DIVD */
#define IFX_EVADC_GLOBCFG_DIVD_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBCFG_Bits.DIVD */
#define IFX_EVADC_GLOBCFG_DIVD_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBCFG_Bits.DIVD */
#define IFX_EVADC_GLOBCFG_DIVD_OFF (8u)

/** \brief  Length for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOBCFG_Bits.SUCAL */
#define IFX_EVADC_GLOBCFG_SUCAL_OFF (31u)

/** \brief  Length for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EVADC_GLOBCFG_SUPLEV_OFF (13u)

/** \brief  Length for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOBCFG_Bits.USC */
#define IFX_EVADC_GLOBCFG_USC_OFF (12u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.AIPE */
#define IFX_EVADC_GLOBICLASS_AIPE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.AIPE */
#define IFX_EVADC_GLOBICLASS_AIPE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.AIPE */
#define IFX_EVADC_GLOBICLASS_AIPE_OFF (22u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.AIPS */
#define IFX_EVADC_GLOBICLASS_AIPS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.AIPS */
#define IFX_EVADC_GLOBICLASS_AIPS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.AIPS */
#define IFX_EVADC_GLOBICLASS_AIPS_OFF (6u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.CME */
#define IFX_EVADC_GLOBICLASS_CME_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.CME */
#define IFX_EVADC_GLOBICLASS_CME_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.CME */
#define IFX_EVADC_GLOBICLASS_CME_OFF (24u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.CMS */
#define IFX_EVADC_GLOBICLASS_CMS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.CMS */
#define IFX_EVADC_GLOBICLASS_CMS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.CMS */
#define IFX_EVADC_GLOBICLASS_CMS_OFF (8u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.SESPE */
#define IFX_EVADC_GLOBICLASS_SESPE_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.SESPE */
#define IFX_EVADC_GLOBICLASS_SESPE_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.SESPE */
#define IFX_EVADC_GLOBICLASS_SESPE_OFF (26u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.SESPS */
#define IFX_EVADC_GLOBICLASS_SESPS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.SESPS */
#define IFX_EVADC_GLOBICLASS_SESPS_MSK (0x1u)

