Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.SESPS */
#define IFX_EVADC_GLOBICLASS_SESPS_OFF (10u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.STCE */
#define IFX_EVADC_GLOBICLASS_STCE_LEN (5u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.STCE */
#define IFX_EVADC_GLOBICLASS_STCE_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.STCE */
#define IFX_EVADC_GLOBICLASS_STCE_OFF (16u)

/** \brief  Length for Ifx_EVADC_GLOBICLASS_Bits.STCS */
#define IFX_EVADC_GLOBICLASS_STCS_LEN (5u)

/** \brief  Mask for Ifx_EVADC_GLOBICLASS_Bits.STCS */
#define IFX_EVADC_GLOBICLASS_STCS_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_GLOBICLASS_Bits.STCS */
#define IFX_EVADC_GLOBICLASS_STCS_OFF (0u)

/** \brief  Length for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_LEN (16u)

/** \brief  Mask for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_ID_Bits.MOD_NUMBER */
#define IFX_EVADC_ID_MOD_NUMBER_OFF (16u)

/** \brief  Length for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_EVADC_ID_Bits.MOD_REV */
#define IFX_EVADC_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_EVADC_ID_Bits.MOD_TYPE */
#define IFX_EVADC_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_EVADC_KRST0_Bits.RST */
#define IFX_EVADC_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_EVADC_KRST0_Bits.RST */
#define IFX_EVADC_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_KRST0_Bits.RST */
#define IFX_EVADC_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_EVADC_KRST0_Bits.RSTSTAT */
#define IFX_EVADC_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_EVADC_KRST0_Bits.RSTSTAT */
#define IFX_EVADC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_KRST0_Bits.RSTSTAT */
#define IFX_EVADC_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_EVADC_KRST1_Bits.RST */
#define IFX_EVADC_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_EVADC_KRST1_Bits.RST */
#define IFX_EVADC_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_KRST1_Bits.RST */
#define IFX_EVADC_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_KRSTCLR_Bits.CLR */
#define IFX_EVADC_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.SUS */
#define IFX_EVADC_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.SUS_P */
#define IFX_EVADC_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.SUSSTA */
#define IFX_EVADC_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.TG_P */
#define IFX_EVADC_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.TGB */
#define IFX_EVADC_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_OCS_Bits.TGS */
#define IFX_EVADC_OCS_TGS_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_LEN (5u)

