Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_OFF (20u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_OFF (23u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_OFF (31u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_OFF (12u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_OFF (13u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_MSK (0x1u)

