Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_OFF (11u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_OFF (2u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_OFF (10u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_OFF (9u)

/** \brief  Length for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_OFF (5u)

/** \brief  Length for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_OFF (8u)

/** \brief  Length for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_LEN (4u)

/** \brief  Mask for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_OFF (7u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_OFF (17u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_LEN (10u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_OFF (22u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_LEN (10u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_LEN (10u)

/** \brief  Mask for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_MSK (0x3ffu)

/** \brief  Offset for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_OFF (6u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.SEQMOD */
#define IFX_EVADC_G_Q_TRCTR_SEQMOD_LEN (6u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.SEQMOD */
#define IFX_EVADC_G_Q_TRCTR_SEQMOD_MSK (0x3fu)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.SEQMOD */
#define IFX_EVADC_G_Q_TRCTR_SEQMOD_OFF (0u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.QACT */
#define IFX_EVADC_G_Q_TRCTR_QACT_LEN (1u)

