Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEvadc_bf.h
/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.QACT */
#define IFX_EVADC_G_Q_TRCTR_QACT_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.QACT */
#define IFX_EVADC_G_Q_TRCTR_QACT_OFF (14u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.OV */
#define IFX_EVADC_G_Q_TRCTR_OV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.OV */
#define IFX_EVADC_G_Q_TRCTR_OV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.OV */
#define IFX_EVADC_G_Q_TRCTR_OV_OFF (15u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_Q_TRCTR_TSCSET_LEN (6u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_Q_TRCTR_TSCSET_MSK (0x3fu)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_Q_TRCTR_TSCSET_OFF (16u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_Q_TRCTR_ITSEL_LEN (2u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_Q_TRCTR_ITSEL_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_Q_TRCTR_ITSEL_OFF (24u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_Q_TRCTR_SRDIS_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_Q_TRCTR_SRDIS_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_Q_TRCTR_SRDIS_OFF (28u)

/** \brief  Length for Ifx_EVADC_G_Q_TRCTR_Bits.COV */
#define IFX_EVADC_G_Q_TRCTR_COV_LEN (1u)

/** \brief  Mask for Ifx_EVADC_G_Q_TRCTR_Bits.COV */
#define IFX_EVADC_G_Q_TRCTR_COV_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_G_Q_TRCTR_Bits.COV */
#define IFX_EVADC_G_Q_TRCTR_COV_OFF (31u)

/** \brief  Length for Ifx_EVADC_RCR_Bits.DMM */
#define IFX_EVADC_RCR_DMM_LEN (2u)

/** \brief  Mask for Ifx_EVADC_RCR_Bits.DMM */
#define IFX_EVADC_RCR_DMM_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_RCR_Bits.DMM */
#define IFX_EVADC_RCR_DMM_OFF (20u)

/** \brief  Length for Ifx_EVADC_RCR_Bits.DRCTR */
#define IFX_EVADC_RCR_DRCTR_LEN (4u)

/** \brief  Mask for Ifx_EVADC_RCR_Bits.DRCTR */
#define IFX_EVADC_RCR_DRCTR_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_RCR_Bits.DRCTR */
#define IFX_EVADC_RCR_DRCTR_OFF (16u)

/** \brief  Length for Ifx_EVADC_RCR_Bits.FEN */
#define IFX_EVADC_RCR_FEN_LEN (2u)

/** \brief  Mask for Ifx_EVADC_RCR_Bits.FEN */
#define IFX_EVADC_RCR_FEN_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_RCR_Bits.FEN */
#define IFX_EVADC_RCR_FEN_OFF (25u)

/** \brief  Length for Ifx_EVADC_RCR_Bits.SRGEN */
#define IFX_EVADC_RCR_SRGEN_LEN (1u)

/** \brief  Mask for Ifx_EVADC_RCR_Bits.SRGEN */
#define IFX_EVADC_RCR_SRGEN_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_RCR_Bits.SRGEN */
#define IFX_EVADC_RCR_SRGEN_OFF (31u)

/** \brief  Length for Ifx_EVADC_RCR_Bits.WFR */
#define IFX_EVADC_RCR_WFR_LEN (1u)

/** \brief  Mask for Ifx_EVADC_RCR_Bits.WFR */
#define IFX_EVADC_RCR_WFR_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_RCR_Bits.WFR */
#define IFX_EVADC_RCR_WFR_OFF (24u)

/** \brief  Length for Ifx_EVADC_RES_Bits.CHNR */
#define IFX_EVADC_RES_CHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.CHNR */
#define IFX_EVADC_RES_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_RES_Bits.CHNR */
#define IFX_EVADC_RES_CHNR_OFF (20u)

/** \brief  Length for Ifx_EVADC_RES_Bits.CRS */
#define IFX_EVADC_RES_CRS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.CRS */
#define IFX_EVADC_RES_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_RES_Bits.CRS */
#define IFX_EVADC_RES_CRS_OFF (28u)

/** \brief  Length for Ifx_EVADC_RES_Bits.DRC */
#define IFX_EVADC_RES_DRC_LEN (4u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.DRC */
#define IFX_EVADC_RES_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_RES_Bits.DRC */
#define IFX_EVADC_RES_DRC_OFF (16u)

/** \brief  Length for Ifx_EVADC_RES_Bits.EMUX */
#define IFX_EVADC_RES_EMUX_LEN (3u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.EMUX */
#define IFX_EVADC_RES_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_RES_Bits.EMUX */
#define IFX_EVADC_RES_EMUX_OFF (25u)

/** \brief  Length for Ifx_EVADC_RES_Bits.RESULT */
#define IFX_EVADC_RES_RESULT_LEN (16u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.RESULT */
#define IFX_EVADC_RES_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_RES_Bits.RESULT */
#define IFX_EVADC_RES_RESULT_OFF (0u)

/** \brief  Length for Ifx_EVADC_RES_Bits.VF */
#define IFX_EVADC_RES_VF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_RES_Bits.VF */
#define IFX_EVADC_RES_VF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_RES_Bits.VF */
#define IFX_EVADC_RES_VF_OFF (31u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.CHNR */
#define IFX_EVADC_RESD_CHNR_LEN (5u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.CHNR */
#define IFX_EVADC_RESD_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.CHNR */
#define IFX_EVADC_RESD_CHNR_OFF (20u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.CRS */
#define IFX_EVADC_RESD_CRS_LEN (2u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.CRS */
#define IFX_EVADC_RESD_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.CRS */
#define IFX_EVADC_RESD_CRS_OFF (28u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.DRC */
#define IFX_EVADC_RESD_DRC_LEN (4u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.DRC */
#define IFX_EVADC_RESD_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.DRC */
#define IFX_EVADC_RESD_DRC_OFF (16u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.EMUX */
#define IFX_EVADC_RESD_EMUX_LEN (3u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.EMUX */
#define IFX_EVADC_RESD_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.EMUX */
#define IFX_EVADC_RESD_EMUX_OFF (25u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.RESULT */
#define IFX_EVADC_RESD_RESULT_LEN (16u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.RESULT */
#define IFX_EVADC_RESD_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.RESULT */
#define IFX_EVADC_RESD_RESULT_OFF (0u)

/** \brief  Length for Ifx_EVADC_RESD_Bits.VF */
#define IFX_EVADC_RESD_VF_LEN (1u)

/** \brief  Mask for Ifx_EVADC_RESD_Bits.VF */
#define IFX_EVADC_RESD_VF_MSK (0x1u)

/** \brief  Offset for Ifx_EVADC_RESD_Bits.VF */
#define IFX_EVADC_RESD_VF_OFF (31u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEVADC_BF_H */
